import os
import random 

def pause():
    try:
        input("\n(Натисни Enter, щоб продовжити...)")
    except (EOFError, KeyboardInterrupt):
        pass

def clear_screen(): # ф-кція для очищення екрану(тобто щоб попередній текст зникав і кожен екран виглядав окремо)
    os.system("cls" if os.name == "nt" else "clear")

def show_intro():
    clear_screen()
    print("=" *80)
    print("                🌴    Jumanji in Ukraine    🌴")
    print("="* 80)
    print()
    print("Друже мандрівнику!😄")
    print()
    print("Ти прокидаєшся серед гранітних брил, що сягають неба.")
    print("Це - Кам'яні Могили, одне з найзагадковіших місць України.")
    print("Колись тут було море, а тепер - кам'яний хаос, де час зупинився.")
    print()
    print("У твоїй руці стара мапа, а на ній написи:")
    print('"Збери сльози землі, що розкидані від сходу до заходу,')
    print(' і відроди силу, яку давно поховали".')
    print()
    print("Перед тобою 5 шляхів до артефактів.")
    print("Кожен крок може стати останнім, але без дії -")
    print("ти назавжди залишишся тут, між каменями.")
    print()
    print("=" * 80)
    print("ПРАВИЛА ГРИ:")
    print("=" * 80)
    print("- w - рух вгору")
    print("- s - рух вниз")
    print("- a - рух вліво")
    print("- d - рух вправо")
    print("- i - переглянути інвентар")
    print("- e - взаємодіяти з об'єктом (стоячи поруч)")
    print("=" * 80)
    input("\nНатисни Enter, щоб почати...")

def show_win(state):
    clear_screen()
    print("\n" + "=" * 80)
    print("                        🏆 ПЕРЕМОГА! 🏆")
    print("=" * 80)
    print("Ти переміг цю гру!!!")
    print(f'{state["name"]}...')
    print(f'Зібрано балів: {state["score"]}/100 ⭐')
    print()
    print("Ти знайшов всі потрібні матеріали і.....")
    print()
    print("Ти чуєш голос землі:")
    print(f'"ДЯКУЮ, {state["name"].upper()}!')
    print('ТИ ЗІБРАВ РОЗКИДАНІ СКАРБИ УКРАЇНИ.')
    print('ТЕПЕР ВОНА МАЄ СИЛУ ВІКІВ.')
    print('ТИ ВРЯТУВАВ ЇЇ ВІД ЗАБУТТЯ."')
    print()
    print("=" * 80)
    print("                        ГРА ПРОЙДЕНА!")
    print("=" * 80)
    print("Твоє ім'я назавжди залишиться в легендах. 🥰")
    print("=" * 80)

def show_extra_win(state):
    clear_screen()
    print("\n" + "=" * 80)
    print("                        ⚡🌟 МАГІЧНА ПЕРЕМОГА 🌟⚡")
    print("=" * 80)
    print(f'{state["name"]}...')
    print(f'Зібрано балів: {state["score"]}/100 ⭐')
    print()
    print("Ти зробив неможливе!")
    print("Ти не просто зібрав усі бонуси - ти перевершив саму долю!")
    print()
    print("За легендою, лише обраний міг пройти цей шлях.")
    print("Але ти... ти зробив це з такою легкістю й мудрістю,")
    print("що самі духи природи схилили голови перед тобою.")
    print()
    print("=" * 80)
    print("Дякуємо, що пройшов цей шлях разом з нами!")
    print("Ти назавжди залишишся в наших серцях, ВЕЛИКИЙ МАГЕ!")
    print("=" * 80)

def show_lose(state):
    clear_screen()
    print("\n" + "=" * 80)
    print("                        💀 ВИ ЗАГИНУЛИ 💀")
    print("=" * 80)
    print()
    print(f'{state["name"]}...')
    print(f'Зібрано балів: {state["score"]}/100 ⭐')
    print("=" * 80)
    print("                        ❌ ГРА ЗАВЕРШЕНА ❌")
    print("=" * 80)
    print("Ми так вірили в тебе.")
    print("Ти пройшов такий довгий шлях, бачив степи, гори, печери...")
    print("Але доля розпорядилася інакше.")
    print()
    print("Україна втратила ще одного героя сьогодні.")
    print("Твоя історія обірвалася на півдорозі.")
    print()
    print("Але знаєш що?")
    print("Кожна поразка - це лише початок нового шляху.")
    print("=" * 80)


WIDTH = 21
HEIGHT = 15

BORDER = "██"
TREE = "🌳"
BUSH = "🌿"
EMPTY = "  "

# Словник: координати (рядок, стовпець) ->номер локації!!!!
LOCATION_COORDS = { (3, 3): 0,    # старт - Кам'яні Могили
                   (7, 13): 1,   # Мармурова печера 
                   (7, 7) : 3,    # Лемурійське озеро
                   (3, 7): 2,    # Стара фортеця
                   (3, 11): 4,   # Сколівські Бескиди
                   (3, 17) : 5,   # (додатковий вихід)
                    
    }

# Кортежі ля гри біля озера Лемурійського
LAKE_STATEMENTS = [
    ("Лемурійське озеро розташоване в Херсонській області.", True),
    ("У Лемурійському озері живуть дельфіни.", False),
    ("Рожевий колір з'являється завдяки мікроводоростям.", True),
    ("Озеро повністю прісне.", False),
    ("Через високу солоність вода добре тримає людину на поверхні.", True),
    ("Узимку озеро завжди стає яскраво-фіолетовим.", False),
]

# Кортежі для вибору предмету на початку
CHEST_ITEMS = [
    ("🗺️ Карта парку", -5, "Вона тобі не потрібна, пупупу."),
    ("🧭 Компас", -1, "Ти випадково взяв поламаний компас."),
    ("💧 Пляшка з водою", 25, "Тепер ти не помреш від спраги."),
    ("🥪 Бутерброд", 9, "Тепер ти не помреш від голоду."),
    ("🔦 Ліхтарик", 5, "Може, допоможе в печері."),
    ("📷 Фотоапарат", 1, "Ці фото потім можна викласти в Інстаграм."),
    ("🩹 Аптечка", 40, "Джекпот! Ти знайшов цінну знахідку."),
]


