import os
import random 

def pause():
    try:
        input("\n(Натисни Enter, щоб продовжити...)")
    except (EOFError, KeyboardInterrupt):
        pass

def clear_screen(): # ф-кція для очищення екрану(тобто щоб попередній текст зникав і кожен екран виглядав окремо)
    os.system("cls" if os.name == "nt" else "clear")

def show_intro():
    clear_screen()
    print("=" *80)
    print("                🌴    Jumanji in Ukraine    🌴")
    print("="* 80)
    print()
    print("Друже мандрівнику!😄")
    print()
    print("Ти прокидаєшся серед гранітних брил, що сягають неба.")
    print("Це - Кам'яні Могили, одне з найзагадковіших місць України.")
    print("Колись тут було море, а тепер - кам'яний хаос, де час зупинився.")
    print()
    print("У твоїй руці стара мапа, а на ній написи:")
    print('"Збери сльози землі, що розкидані від сходу до заходу,')
    print(' і відроди силу, яку давно поховали".')
    print()
    print("Перед тобою 5 шляхів до артефактів.")
    print("Кожен крок може стати останнім, але без дії -")
    print("ти назавжди залишишся тут, між каменями.")
    print()
    print("=" * 80)
    print("ПРАВИЛА ГРИ:")
    print("=" * 80)
    print("- w - рух вгору")
    print("- s - рух вниз")
    print("- a - рух вліво")
    print("- d - рух вправо")
    print("- i - переглянути інвентар")
    print("- e - взаємодіяти з об'єктом (стоячи поруч)")
    print("=" * 80)
    input("\nНатисни Enter, щоб почати...")

def show_win(state):
    clear_screen()
    print("\n" + "=" * 80)
    print("                        🏆 ПЕРЕМОГА! 🏆")
    print("=" * 80)
    print("Ти переміг цю гру!!!")
    print(f'{state["name"]}...')
    print(f'Зібрано балів: {state["score"]}/100 ⭐')
    print()
    print("Ти знайшов всі потрібні матеріали і.....")
    print()
    print("Ти чуєш голос землі:")
    print(f'"ДЯКУЮ, {state["name"].upper()}!')
    print('ТИ ЗІБРАВ РОЗКИДАНІ СКАРБИ УКРАЇНИ.')
    print('ТЕПЕР ВОНА МАЄ СИЛУ ВІКІВ.')
    print('ТИ ВРЯТУВАВ ЇЇ ВІД ЗАБУТТЯ."')
    print()
    print("=" * 80)
    print("                        ГРА ПРОЙДЕНА!")
    print("=" * 80)
    print("Твоє ім'я назавжди залишиться в легендах. 🥰")
    print("=" * 80)

def show_extra_win(state):
    clear_screen()
    print("\n" + "=" * 80)
    print("                        ⚡🌟 МАГІЧНА ПЕРЕМОГА 🌟⚡")
    print("=" * 80)
    print(f'{state["name"]}...')
    print(f'Зібрано балів: {state["score"]}/100 ⭐')
    print()
    print("Ти зробив неможливе!")
    print("Ти не просто зібрав усі бонуси - ти перевершив саму долю!")
    print()
    print("За легендою, лише обраний міг пройти цей шлях.")
    print("Але ти... ти зробив це з такою легкістю й мудрістю,")
    print("що самі духи природи схилили голови перед тобою.")
    print()
    print("=" * 80)
    print("Дякуємо, що пройшов цей шлях разом з нами!")
    print("Ти назавжди залишишся в наших серцях, ВЕЛИКИЙ МАГЕ!")
    print("=" * 80)

def show_lose(state):
    clear_screen()
    print("\n" + "=" * 80)
    print("                        💀 ВИ ЗАГИНУЛИ 💀")
    print("=" * 80)
    print()
    print(f'{state["name"]}...')
    print(f'Зібрано балів: {state["score"]}/100 ⭐')
    print("=" * 80)
    print("                        ❌ ГРА ЗАВЕРШЕНА ❌")
    print("=" * 80)
    print("Ми так вірили в тебе.")
    print("Ти пройшов такий довгий шлях, бачив степи, гори, печери...")
    print("Але доля розпорядилася інакше.")
    print()
    print("Україна втратила ще одного героя сьогодні.")
    print("Твоя історія обірвалася на півдорозі.")
    print()
    print("Але знаєш що?")
    print("Кожна поразка - це лише початок нового шляху.")
    print("=" * 80)


WIDTH = 21
HEIGHT = 15

BORDER = "██"
TREE = "🌳"
BUSH = "🌿"
EMPTY = "  "

# Кортежі ля гри біля озера Лемурійського
LAKE_STAT = [
    ("Лемурійське озеро розташоване в Херсонській області.", True),
    ("У Лемурійському озері живуть дельфіни.", False),
    ("Рожевий колір з'являється завдяки мікроводоростям.", True),
    ("Озеро повністю прісне.", False),
    ("Через високу солоність вода добре тримає людину на поверхні.", True),
    ("Узимку озеро завжди стає яскраво-фіолетовим.", False),
]

# Кортежі для вибору предмету на початку
CHEST_ITEMS = [
    ("🗺️ Карта парку", -5, "Вона тобі не потрібна, пупупу."),
    ("🧭 Компас", -1, "Ти випадково взяв поламаний компас."),
    ("💧 Пляшка з водою", 25, "Тепер ти не помреш від спраги."),
    ("🥪 Бутерброд", 9, "Тепер ти не помреш від голоду."),
    ("🔦 Ліхтарик", 5, "Може, допоможе в печері."),
    ("📷 Фотоапарат", 1, "Ці фото потім можна викласти в Інстаграм."),
    ("🩹 Аптечка", 40, "Джекпот! Ти знайшов цінну знахідку."),
]


LOCATIONS = {
    0: {
        "name": "КАМ'ЯНІ МОГИЛИ",
        "emoji": " 🪨",
        "about": 
            "Найвища точка Приазовської височини (324 м).\n"
            "Унікальний гранітний масив, що залишився від давніх гір.\n"
            "Тут ростуть реліктові рослини, а вітер постійно змінює обриси каменів.\n"
            "У 2009 році ця територія стала ландшафтним заказником." ,
        "item": None,
        "npc": "",
    },
    1: {
        "name": "МАРМУРОВА ПЕЧЕРА",
        "emoji": " 🕯️",
        "about": 
            "Одна з найкрасивіших печер Європи, на Демерджі-яйла (Крим).\n"
            "Протяжність - понад 2 км, глибина - 60 м.\n"
            "Зали рожевого мармуру, сталактити та сталагміти.\n"
            "Температура в печері постійно тримається близько +9°C."
        ,
        "item": "Кристал життя",
        "npc": "Кажан на ім'я Гриць",
    },
    2: {
        "name": "СТАРА ФОРТЕЦЯ",
        "emoji": " 🏛️",
        "about": 
            "Одна з найкраще збережених середньовічних фортець України.\n"
            "Розташована на скелястому острові над каньйоном річки Смотрич,\n"
            "у місті Кам'янець-Подільський."
        ,
        "item": "Скарб везучості",
        "npc": "Тамтешній житель",
    },
    3: {
        "name": "ЛЕМУРІЙСЬКЕ ОЗЕРО",
        "emoji": "🌊",
        "about": 
            "Унікальне рожеве солоне озеро в Херсонській області.\n"
            "Незвичайний колір утворюється завдяки мікроводоростям.\n"
            "Дуже висока концентрація солі."
        ,
        "item": "Рожева сіль",
        "npc": "Лемура",
    },
    4: {
        "name": "СКОЛІВСЬКІ БЕСКИДИ",
        "emoji": " ⛰️",
        "about": 
            "Край гір, працьовитих бойків і природних див.\n"
            "Резерват природи біля Східниці, Славська, Тисовця,\n"
            "з найвищою горою 1268 метрів."
        ,
        "item": "Золотий мухомор",
        "npc": "Живчик",
    },
    5: {
        "name": "ТАЄМНИЙ ПОРТАЛ",
        "emoji": "🟢",
        "about": "Прихований шлях, про який мало хто знає...",
        "item": None,
        "npc": "",
    },
}

LOCATIONS_LIST = [
    {"row": 3, "col": 3, "id": 0},   # Кам'яні Могили
    {"row": 10, "col": 13, "id": 1},  # Мармурова печера
    {"row": 2, "col": 9, "id": 2},   # Стара фортеця
    {"row": 8, "col": 7, "id": 3},   # Лемурійське озеро
    {"row": 5, "col": 14, "id": 4},  # Сколівські Бескиди
    {"row": 12, "col": 18, "id": 5},  # Таємний портал
]

def build_map():
    grid = []
    for r in range(HEIGHT):
        row = []
        for c in range(WIDTH):
            if r == 0 or r == HEIGHT - 1 or c == 0 or c == WIDTH - 1:
                row.append(BORDER)
            else:
                row.append(EMPTY)
        grid.append(row)

    for i in range(25):
        r = random.randint(1, HEIGHT - 2)
        c = random.randint(1, WIDTH - 2)
        grid[r][c] = TREE

    for i in range(15):
        r = random.randint(1, HEIGHT - 2)
        c = random.randint(1, WIDTH - 2)
        grid[r][c] = BUSH

    for loc in LOCATIONS_LIST:
        row = loc["row"]
        col = loc["col"]
        loc_id = loc["id"]
        grid[row][col] = LOCATIONS[loc_id]["emoji"]

    return grid


def render_map(grid, player_row, player_col):

    rows = []
    for row in range(HEIGHT):
        line = ""
        for col in range(WIDTH):
            if row == player_row and col == player_col:
                line = line + "👤" 
            else:
                line = line + grid[row][col] 
        
        rows.append(line)
    
    return "\n".join(rows)
